## Introduction to Databases

### Accessing Relational Databases - MySQL

In [1]:
import os
import sys
import time
import datetime
import numpy as np
import pandas as pd
import pathlib
import getpass

import pymysql

### Acessing [MySQL](https://pypi.python.org/pypi/PyMySQL)

In [2]:
p = getpass.getpass()
conn = pymysql.connect(host='localhost', port=3306, user='root', passwd = p) #passwd=password, db='mysql')
cur = conn.cursor()

 ········

In [3]:
cur.execute("show databases;")
for r in cur.fetchall():
   print(r)

('information_schema',)
('example',)
('mysql',)
('performance_schema',)
('sys',)

In [4]:
cur.execute("use mysql;")
cur.execute("show tables;")
for r in cur.fetchall():
   print(r)

('columns_priv',)
('db',)
('engine_cost',)
('event',)
('func',)
('general_log',)
('gtid_executed',)
('help_category',)
('help_keyword',)
('help_relation',)
('help_topic',)
('innodb_index_stats',)
('innodb_table_stats',)
('ndb_binlog_index',)
('plugin',)
('proc',)
('procs_priv',)
('proxies_priv',)
('server_cost',)
('servers',)
('slave_master_info',)
('slave_relay_log_info',)
('slave_worker_info',)
('slow_log',)
('tables_priv',)
('time_zone',)
('time_zone_leap_second',)
('time_zone_name',)
('time_zone_transition',)
('time_zone_transition_type',)
('user',)

In [5]:
cur.execute("CREATE DATABASE IF NOT EXISTS example;")
cur.execute("USE example;")
cur.execute('''CREATE TABLE IF NOT EXISTS my_table 
               (text VARCHAR(200)
               DEFAULT NULL)
               ENGINE=MyISAM DEFAULT CHARSET='utf8';''')

cur.execute("show tables;")
for r in cur.fetchall():
   print(r)

('my_new_table',)
('my_table',)

/home/rsouza/Documents/envs/python_env/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1007, "Can't create database 'example'; database exists")
  result = self._query(query)
/home/rsouza/Documents/envs/python_env/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1050, "Table 'my_table' already exists")
  result = self._query(query)

In [6]:
texts = ['It always seems impossible until its done.',
         'In order to succeed, we must first believe that we can.',
         'Life is 10% what happens to you and 90% how you react to it.',
         'Start where you are. Use what you have. Do what you can.',]

cur.executemany('INSERT INTO example.my_table (text) VALUES (%s)', texts)

4

In [7]:
cur.execute("SELECT * FROM example.my_table;")# LIMIT 10;")
for r in cur.fetchall():
   print(r)

('It always seems impossible until its done.',)
('In order to succeed, we must first believe that we can.',)
('Life is 10% what happens to you and 90% how you react to it.',)
('Start where you are. Use what you have. Do what you can.',)
('It always seems impossible until its done.',)
('In order to succeed, we must first believe that we can.',)
('Life is 10% what happens to you and 90% how you react to it.',)
('Start where you are. Use what you have. Do what you can.',)

### Using Pandas for querying

In [8]:
import pandas.io.sql as psql

In [9]:
df_mysql = psql.read_sql('select * from example.my_table;', con=conn)

In [10]:
df_mysql.head()

                                                text
0         It always seems impossible until its done.
1  In order to succeed, we must first believe tha...
2  Life is 10% what happens to you and 90% how yo...
3  Start where you are. Use what you have. Do wha...
4         It always seems impossible until its done.

In [11]:
cur.close()
conn.close()

### Using Pandas for reading a [CSV](https://www.generatedata.com/) file and [write in a Database](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_sql.html)

In [12]:
from sqlalchemy import create_engine

In [13]:
df = pd.read_csv('../SampleDBs/fakedata.csv', sep='|')
df.head(10)

        name                                 email birthdate
0     Fatima       Quisque.varius@Integervitae.org  11-25-01
1    Katelyn              mi.pede.nonummy@Sedid.ca  11-27-03
2    Gillian  odio.semper@sodalesMaurisblandit.org  02-19-14
3    Preston        faucibus.orci@lacusQuisque.edu  08-07-09
4  Priscilla  semper.auctor@cursusvestibulum.co.uk  08-12-01
5       Zena                ante@magnaPraesent.com  11-24-11
6       Oren            rutrum.eu.ultrices@nec.org  01-12-07
7    Jamalia        Phasellus.vitae.mauris@vel.org  05-17-17
8      Libby               velit.eu@Maecenasmi.edu  07-29-17
9       Finn         natoque.penatibus@lectusa.net  06-23-10

#### Creating the Database

In [16]:
user = 'root'
passw = 'password'
host =  'localhost'
port = 3306
database = 'example'

conn = pymysql.connect(host=host, port=port, user=user, passwd=passw)
conn.cursor().execute("CREATE DATABASE IF NOT EXISTS {0} ".format(database))

1

#### Dumping the Dataframe to the Database in a new table

In [17]:
#engine = create_engine('mysql+pymysql://user:password@localhost/database')
engine = create_engine('mysql+pymysql://root:password@localhost/example')
df.to_sql(name='my_new_table', con=engine, if_exists='replace', index=True, index_label='id_user')

#### Setting the Primary Key

In [18]:
with engine.connect() as conn:
    conn.execute('ALTER TABLE my_new_table ADD PRIMARY KEY (id_user);')

#### Verifying te Results

In [19]:
conn = pymysql.connect(host=host, port=port, user=user, passwd=passw)
cur = conn.cursor()

In [20]:
cur.execute("show databases;")
for r in cur.fetchall():
     print(r)

('information_schema',)
('example',)
('mysql',)
('performance_schema',)
('sys',)

In [21]:
cur.execute("use example;")
cur.execute("show tables;")
for r in cur.fetchall():
     print(r)

('my_new_table',)
('my_table',)

In [22]:
cur.execute("describe my_new_table;")
for r in cur.fetchall():
     print(r)

('id_user', 'bigint(20)', 'NO', 'PRI', None, '')
('name', 'text', 'YES', '', None, '')
('email', 'text', 'YES', '', None, '')
('birthdate', 'text', 'YES', '', None, '')

In [23]:
cur.execute("select * from my_new_table;")
for r in cur.fetchmany(10):
     print(r)

(0, 'Fatima', 'Quisque.varius@Integervitae.org', '11-25-01')
(1, 'Katelyn', 'mi.pede.nonummy@Sedid.ca', '11-27-03')
(2, 'Gillian', 'odio.semper@sodalesMaurisblandit.org', '02-19-14')
(3, 'Preston', 'faucibus.orci@lacusQuisque.edu', '08-07-09')
(4, 'Priscilla', 'semper.auctor@cursusvestibulum.co.uk', '08-12-01')
(5, 'Zena', 'ante@magnaPraesent.com', '11-24-11')
(6, 'Oren', 'rutrum.eu.ultrices@nec.org', '01-12-07')
(7, 'Jamalia', 'Phasellus.vitae.mauris@vel.org', '05-17-17')
(8, 'Libby', 'velit.eu@Maecenasmi.edu', '07-29-17')
(9, 'Finn', 'natoque.penatibus@lectusa.net', '06-23-10')